GB-Link/GB-Link-Switch-LDN/firmware/esp32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_LWIP_DHCPS_STATIC_ENTRIES=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# The RFU link task owns core 1 outright and must never yield: at 2 MHz a whole
# 32-bit word is 16 us, so even a single 1 ms tick of vTaskDelay is a 60-word
# blind window. Stop the watchdog expecting core 1's idle task to run.
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
